{"posts":[{"i_news_id":"402","s_headline":"Trump\"s Win Won\"t Affect India\"s Textile Export","s_content":"Republican presidency candidate Donald Trump\"s win will not affect Indian textile and apparel exports to the US as was being contemplated earlier due to him being the chairman and president of business conglomerate Trump Organization. Exporting textile from India is comparatively cheaper than manufacturing it in the USA & hence the status quo is likely to remain unaffected.","s_source":"http:\/\/localhost\/media\/20161115034921201609030007413-09-16(web1).jpg"},{"i_news_id":"401","s_headline":"Smart Textiles With Medical App Is a High Potential Market","s_content":"Various tech giants have started working towards the untapped market of wearabes for elder by making advancement in nanotechnology & 'smart clothes' to monitor their own health. Smart textile industrys medical application is expected to reach $843 million by 2021. T-shirts tracking Stress levels & sending vital signs to docs already exists.","s_source":"http:\/\/localhost\/media\/20161115034824201609030023463-09-16(web4).jpg"},{"i_news_id":"400","s_headline":"EU Open To Possibilities Of Tie Ups With Pakistan","s_content":"In a meeting with All Pakistan Textile Mills Association, EU Ambassador to Pakistan J F Cautain spoke about a possibility of a 5 yr. strategic partnership in between APTMA and EU. Sr. VC of APTMA Mr Mazhar requested him to encourage big brands in the EU to buy from Pakistan as it is ideally placed for high-quality textile goods at competitive prices.\r\n","s_source":"http:\/\/localhost\/media\/2016111503473320160821092056Organicclothes1.jpg"},{"i_news_id":"399","s_headline":"Australian Government Funds Pakistan Farmers Training","s_content":"A new aid initiative, the Australian Government\"s Business Partnerships Platform, has granted $500,000 to BCI with these funds matched by global brands and then invested in training for Pakistan\"s cotton farmers. Once trained and a license issued, these farmers can sell their fibre as Better Cotton into the world market.","s_source":"http:\/\/localhost\/media\/201610201215052016091100044511-09-16(1).jpg"},{"i_news_id":"398","s_headline":"Rwanda Envisages Tailor School To","s_content":"Rwandan govt, in order to eliminate secondhand clothes, is planning to establish a modern tailoring school to contribute toward the promotion of the textile industry announced during a consultative meeting among officials of NEP. WDA will operated the school will be in collaboration with C&H Garments, a Chinese owned company, according to officials.","s_source":"http:\/\/localhost\/media\/20161020121412201609090038289-09-16(5).jpg"},{"i_news_id":"397","s_headline":"Korean shipping company bankruptcy delays delivery for holiday season in US","s_content":"Korean shipping company Hanjin has become bankrupt. One of the largest container movers, it shipped nearly 8% of the trans-Pacific trade. As it filed for bankruptcy, terminal operators, truckers and others have stop handling the company\"s cargo impacting retailers as Wal-Mart , Target, J.C. Penney.","s_source":"http:\/\/localhost\/media\/20161020121328201609070013447-09-16(5).jpg"},{"i_news_id":"396","s_headline":"Santex Rimar to invest in China","s_content":"Santex Rimar is looking to invest in China by establishing a production site at Qingpu,Shanghai. It has also established New Smit China to remain committed to the country. The group has 30,000 machines installed worldwide. It acquired SMIT ,the acknowledged leader of weaving technology earlier this year","s_source":"http:\/\/localhost\/media\/20161020121246201608210931147fb91d92be87a0f1cfdfb94d9df03d24.jpg"},{"i_news_id":"395","s_headline":"Paula Schneider is the new Chief Executive of DG Premium Brands","s_content":"Delta Galil which recently acquired 3 premium brands from VF Corp has announced that Paula Schneider will be its new Chief Executive. DG Premium Brands owns labels as 7 For All Mankind, Ella Moss and Splendid. Schneider recently was Chief Executive of American Apparel which she turned around from bankruptcy.","s_source":"http:\/\/localhost\/media\/2016102012120820160813015940downloadj.jpg"},{"i_news_id":"394","s_headline":"UBE to expand nylon 6 resin production","s_content":"World\"s largest nylon producers, UBE will add an additional 40,000 tons of nylon 6 manufacturing capacity at its Spanish subsidiary. It already produces 158,000 tons per annum of the product which is used to as a replacement of polyvinylidene chloride (PVDC) films and makes packaging greener for foods and detergents.","s_source":"http:\/\/localhost\/media\/2016102012092120160812090349news011px.jpg"},{"i_news_id":"393","s_headline":"China to invest US$ 8 billion in new textile capacities In cotton producing Xinjiang region","s_content":"Cotton producing Xinjiang region will become China\\\\\\\\\\\\\\\"s largest textile production base by 2030. The investments in the sector will be at the Korla Economic and Technical Development Zone will promote green, clean, intelligent manufacturing. However, the ambitious project maybe beset with shortages of water, power.","s_source":"http:\/\/localhost\/media\/2016102012010420160814042713download m.jpg"}]}